#### GeometryInstance Members

---

|  |
| --- |
| GeometryInstance Class   Methods   Properties   See Also |

The  GeometryInstance  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  GeometryObject  .) |
| Public method | GetDocument | Gets the document that contains the symbol of this instance. |
| Public method | GetHashCode | Gets the integer value of the geometry object as hash code (Inherited from  GeometryObject  .) |
| Public method | GetInstanceGeometry | Computes the geometric representation of the instance. |
| Public method | GetInstanceGeometry(Transform) | Computes a transformation of the geometric representation of the instance. |
| Public method | GetSymbolGeometry | Computes the geometric representation of the symbol which generates this instance. |
| Public method | GetSymbolGeometry(Transform) | Computes a transformation of the geometric representation of the symbol which generates this instance. |
| Public method | GetSymbolGeometryId | Gets the SymbolGeometryId that contains data about the symbol of this instance. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle (Inherited from  GeometryObject  .) |
| Public property | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement. (Inherited from  GeometryObject  .) |
| Public property | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element. (Inherited from  GeometryObject  .) |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | Symbol | **Obsolete.**   The symbol element that this object is referring to. |
| Public property | SymbolGeometry | The geometric representation of the symbol which generates this instance. |
| Public property | Transform | The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance. |
| Public property | Visibility | The visibility. (Inherited from  GeometryObject  .) |

# See Also

GeometryInstance Class

Autodesk.Revit.DB Namespace